docs(guides): migrate diagrams to plantuml
